tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Java-based project management
brew "maven"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Quick and easy command-line file transfer utility from any computer to another
brew "portal"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# App to build and share containerized applications and microservices
cask "docker"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility that shows the latest app updates
cask "latest"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# TeX previewer
cask "texshop"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "aaron-bond.better-comments"
vscode "basdp.language-gas-x86"
vscode "daohong-emilio.yash"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "kevinkyang.auto-comment-blocks"
vscode "luniclynx.lex"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "SeyyedKhandon.firacode"
vscode "sissel.shopify-liquid"
vscode "stkb.rewrap"
vscode "yzhang.markdown-all-in-one"
